import random
from typing import Any, Union
from utils.basicEvent import send
from utils.standardPlugin import StandardPlugin

FOOD_LIST = ["尊宝披萨", "白萝卜焖牛排骨", "板栗焖饭", "拌饭", "包子", "煲仔饭", "北京烤鸭", "本帮菜", "比萨", "必胜客", "便当", "饽饽", "叉烧包", "叉烧饭", "茶餐厅", "肠粉", "潮汕砂锅粥", "炒饭", "炒粉", "炒河粉", "炒米粉", "炒面", "臭豆腐", "川菜", "串串香", "刺身", "葱花饼", "葱油拌面", "大排档", "担担面", "蛋包饭", "蛋炒饭", "蛋糕", "蛋挞", "刀削面", "德克士", "东南亚菜", "东坡肉", "盖浇饭", "盖码饭", "宫保鸡丁", "关东煮", "锅盔", "锅贴", "过桥米线", "海底捞", "海南鸡饭", "海南椰子鸡", "海鲜", "韩国料理", "韩式部队火锅", "韩式烤肉", "韩式炸鸡", "汉堡", "汉堡薯条", "汉堡王", "荷包蛋", "盒饭", "红烧肉", "华莱士", "黄焖鸡", "黄焖鸡米饭", "黄桥烧饼", "回锅肉", "回转寿司", "茴香肉包", "烩面", "馄饨", "火锅", "火锅鸡", "火腿", "火腿鹿茸菇炒荷兰豆", "鸡公煲", "煎饼", "煎饼果子", "煎蛋", "煎饺", "酱骨头", "饺子", "金百味", "咖啡", "咖喱饭", "咖喱乌冬", "烤串", "烤韭菜", "烤冷面", "烤面筋", "烤肉", "烤肉拌饭", "烤肉定食", "烤肉饭", "烤鸭", "烤鱼", "肯德基", "快餐", "拉面", "辣椒炒肉", "辣子鸡", "兰州拉面", "凉皮", "凉皮儿", "浏阳蒸菜", "流沙包", "卤粉", "卤肉饭", "卤味", "螺蛳粉", "驴肉火烧", "麻辣烫", "麻辣兔头", "麻辣香锅", "麻婆豆腐", "麦当劳", "馒头", "满汉全席", "毛血旺", "冒菜", "米线", "面包", "面馆", "面条", "南瓜粥", "嫩牛五方", "年糕", "牛丼", "牛丼饭", "牛排", "牛肉粉", "牛肉焗米粉", "牛肉面", "农家菜", "泡椒凤爪", "泡面", "披萨", "皮蛋瘦肉粥", "苹果", "荞麦面", "桥头排骨", "亲子丼", "热干面", "日本料理", "日式拉面", "日式烧肉饭", "肉包", "肉夹馍", "肉汁拌饭", "三明治", "臊子面", "杀猪粉", "沙县小吃", "砂锅", "山东煎饼", "尚品佳味", "烧鸡", "烧烤", "烧腊饭", "烧卖", "烧鸭饭", "生煎", "石锅拌饭", "寿司", "寿喜锅", "树底烧腊", "涮羊肉", "水果", "水饺", "水煮牛肉", "水煮肉片", "水煮鱼", "速冻水饺", "酸菜鱼", "酸辣粉", "酸奶", "台湾卤肉饭", "泰餐", "糖醋里脊", "天妇罗", "天津饭", "甜点", "铁板烧", "土豆粉", "味千拉面", "乌冬面", "五谷渔粉", "悟粉", "西北风", "西餐", "虾饺", "鲜肉馄饨", "咸肉菜饭", "香蕉", "湘菜", "小肥羊", "小龙坎火锅", "小龙虾", "小笼包", "蟹黄包", "新疆炒米粉", "鸭血粉丝", "燕麦片", "扬州炒饭", "羊肉串", "羊肉泡馍", "羊肉汤", "羊蝎子", "阳春面", "意大利面", "油泼面", "油条", "油炸烧烤", "鱼香肉丝", "玉米糊", "裕香源", "原牛道", "粤菜", "粤式早茶", "云吞面", "炸串", "炸鸡", "炸酱面", "臻食荟", "蒸菜", "蒸饺", "重庆小面", "粥", "猪肚鸡", "猪脚饭", "猪排饭", "竹笋烤肉", "自助餐", "西北风", "None"]

DRINK_LIST = ["书亦烧仙草", "冰摇桃桃乌龙茶", "冰摇红莓黑加仑茶", "冰摇芒果花草茶", "冰淇淋红茶", "冰鲜柠檬水", "冷萃浮乐朵", "凉白开", "卡布奇诺", "双拼奶茶", "可口可乐", "吃土摇摇奶昔", "喜茶轻芒芒甘露", "四季春燕麦奶茶", "四季春珍珠奶茶", "四季春茶", "奥利奥味雪王大圣代", "奥利奥大圣代", "抹茶星冰乐", "抹茶红豆拿铁", "招牌芋圆奶茶", "摩卡", "摩卡可可碎片星冰乐", "摩卡星冰乐", "晨露抹茶", "杨枝甘露", "杨枝甘露烧仙草", "柠檬红茶", "柠檬芦荟茶", "桂花酒酿", "桃气乌龙奶芙", "桃气乌龙豆乳", "梨光清润路芭茶", "棒打鲜橙", "椰乳芋泥茫茫", "榛果风味拿铁", "橙柚派对", "气炫冰山美式", "浓缩咖啡", "满杯橙海粒", "烤奶珍珠奶茶", "焦糖浓缩咖啡星冰乐", "焦糖玛奇朵", "焦糖珍珠", "牛魔王黑砖奶茶", "珍珠奶茶", "百事可乐", "百香凤梨", "百香金菠萝", "皇家九号奶茶", "红茶", "红豆奶茶", "绿茶", "美式咖啡", "芋泥厚厚牛乳", "芒果西番莲果茶星冰乐", "芝士四季春", "芝士奶盖四季春", "芝士奶盖绿茶", "芝士抹茶", "芝士鲜红茶", "芝士鲜绿茶", "草莓味雪王大圣代", "草莓雪王大圣代", "葡萄柚绿茶", "蓝莓味雪王大圣代", "蓝莓大圣代", "蓝莓摇摇奶昔", "蓝莓果粒茶", "蜂蜜柚子茶", "西北风", "豆乳绵绵奶茶", "酒香沁乌龙", "酸柠浮冷萃", "醋意桃桃", "阿馥奇朵", "香草风味拿铁", "馥芮白", "马来西亚白咖啡", "鲜橙葡萄柚", "鲜芒果绿茶", "鹿丸可可鲜奶", "麦芽雪冷萃", "黑巧橙香乌龙", "黑糖珍珠奶茶"]

class TodayEatWhat(StandardPlugin):
    def __init__(self) -> None:
        self.resource = FOOD_LIST
    def judgeTrigger(self, msg:str, data:Any) -> bool:
        return msg in ['-今天吃什么', '今天吃什么'] and self.resource != None
    def executeEvent(self, msg:str, data:Any) -> Union[None, str]:
        target = data['group_id'] if data['message_type']=='group' else data['user_id']
        food = random.choice(self.resource)
        if food == "None":
            send(target, "今天不吃饭！", data['message_type'])
            return "OK"
        send(target, f"今天吃“{food}”！", data['message_type'])
        return "OK"
    def getPluginInfo(self, )->Any:
        return {
            'name': 'TodayEatWhat',
            'description': '今天吃什么',
            'commandDescription': '今天吃什么 / -今天吃什么',
            'usePlace': ['group', 'private', ],
            'showInHelp': True,
            'pluginConfigTableNames': [],
            'version': '1.0.0',
            'author': 'Lonewiser',
        }

class TodayDrinkWhat(StandardPlugin):
    def __init__(self) -> None:
        self.resource = DRINK_LIST
    def judgeTrigger(self, msg:str, data:Any) -> bool:
        return msg in ['-今天喝什么', '今天喝什么'] and self.resource != None
    def executeEvent(self, msg:str, data:Any) -> Union[None, str]:
        target = data['group_id'] if data['message_type']=='group' else data['user_id']
        drink = random.choice(self.resource)
        send(target, f"今天喝“{drink}”！", data['message_type'])
        return "OK"
    def getPluginInfo(self, )->Any:
        return {
            'name': 'TodayDrinkWhat',
            'description': '今天喝什么',
            'commandDescription': '今天喝什么 / -今天喝什么',
            'usePlace': ['group', 'private', ],
            'showInHelp': True,
            'pluginConfigTableNames': [],
            'version': '1.0.0',
            'author': 'Lonewiser',
        }